20240623T212808--kdoc-193-共通言語としてのプログラミング言語__draft_essay.org
:properties:
:ID: 20240623T212808
:end:
#+title:      KDOC 193: 共通言語としてのプログラミング言語
#+date:       [2024-06-23 Sun 21:28]
#+filetags:   :draft:essay:
#+identifier: 20240623T212808

# (denote-rename-file-using-front-matter (buffer-file-name) 0)
# (save-excursion (while (re-search-backward ":draft" nil t) (replace-match "")))
# (flush-lines "^\\#\s.+?")

# ====ポリシー。
# 1ファイル1アイデア。
# 1ファイルで内容を完結させる。
# 常にほかのエントリとリンクする。
# 自分の言葉を使う。
# 参考文献を残しておく。
# 文献メモの場合は、感想と混ぜないこと。1つのアイデアに反する
# ツェッテルカステンの議論に寄与するか
# 頭のなかやツェッテルカステンにある問いとどのようにかかわっているか
# エントリ間の接続を発見したら、接続エントリを追加する。カード間にあるリンクの関係を説明するカード。
# アイデアがまとまったらアウトラインエントリを作成する。リンクをまとめたエントリ。
# エントリを削除しない。古いカードのどこが悪いかを説明する新しいカードへのリンクを追加する。
# 恐れずにカードを追加する。無意味の可能性があっても追加しておくことが重要。

# ====永久保存メモのルール。
# 自分の言葉で書く。
# 後から読み返して理解できる。
# 他のメモと関連付ける。
# ひとつのメモにひとつのことだけを書く。
# メモの内容は1枚で完結させる。
# 論文の中に組み込み、公表できるレベルである。

# ====価値があるか。
# その情報がどういった文脈で使えるか。
# どの程度重要な情報か。
# そのページのどこが本当に必要な部分なのか。

* この文書のステータス
- 作成
  - [X] 2024-06-23 貴島
- レビュー
  - [ ] <署名>
# (progn (kill-line -1) (insert (format "  - [X] %s 貴島" (format-time-string "%Y-%m-%d"))))

# 関連をつけた。
# タイトルがフォーマット通りにつけられている。
# 内容をブラウザに表示して読んだ(作成とレビューのチェックは同時にしない)。
# 文脈なく読めるのを確認した。
# おばあちゃんに説明できる。
# いらない見出しを削除した。
# タグを適切にした。
# すべてのコメントを削除した。
* 概要
# 本文(タイトルをつける)。
[[id:20240612T133312][KDOC 190: 『Rubyのしくみ Ruby Under a Microscope』]]を読んでいて、感銘を受けた。普段あたりまえのように使っているクラスやハッシュ、ブロック...などが、どうやって実装されているかについてバーチャルマシン命令レベルで解説している。時間をかけて咀嚼し、腑に落ちる感じがあった。

もう2年くらい[[id:cfd092c4-1bb2-43d3-88b1-9f647809e546][Ruby]]は使っていなくて細かい部分はあまり覚えていないが、もし経験していなかったらこの感動は得にくかっただろう。プログラミング言語には、単に実装のためだけでなく、先人の知見を学ぶ共通言語として必要な面がある。特定の領域知識は、プログラミング言語によって偏って存在している。

一度なにかの言語で学べば、ほかの言語と比較して理解しやすかったり、処理系に対しての改善を考えやすい。仕事で使わなくても、教養として理解しておくと助かることがある。

* 関連
# 関連するエントリ。なぜ関連させたか理由を書く。意味のあるつながりを意識的につくる。
# この事実は自分のこのアイデアとどう整合するか。
# この現象はあの理論でどう説明できるか。
# ふたつのアイデアは互いに矛盾するか、互いを補っているか。
# いま聞いた内容は以前に聞いたことがなかったか。
# メモ y についてメモ x はどういう意味か。
- [[denote:20240529T002323][KDOC 179: 『ハロー“Hello, World” OSと標準ライブラリのシゴトとしくみ』]]でも、別の実装を見て比較してみる重要性が説かれていた
- [[id:20240612T133312][KDOC 190: 『Rubyのしくみ Ruby Under a Microscope』]]を読んでいて考えたこと
