20240623T212808--kdoc-193-共通言語としてのプログラミング言語__draft_essay.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-06-26 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>KDOC 193: 共通言語としてのプログラミング言語</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">KDOC 193: 共通言語としてのプログラミング言語</h1>

<div id="outline-container-org665f551" class="outline-2">
<h2 id="org665f551"><a href="#org665f551">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org665f551">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-06-23 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgbc2bde1" class="outline-2">
<h2 id="orgbc2bde1"><a href="#orgbc2bde1">概要</a></h2>
<div class="outline-text-2" id="text-orgbc2bde1">
<p>
<a href="20240612T133312--kdoc-190-『rubyのしくみ-ruby-under-a-microscope』__draft_book.html#ID-20240612T133312">KDOC 190: 『Rubyのしくみ Ruby Under a Microscope』</a>を読んでいて、感銘を受けた。普段あたりまえのように使っているクラスやハッシュ、ブロック&#x2026;などが、どうやって実装されているかについてバーチャルマシン命令レベルで解説している。時間をかけて咀嚼し、腑に落ちる感じがあった。
</p>

<p>
もう2年くらい<a href="20210509095513-ruby.html#ID-cfd092c4-1bb2-43d3-88b1-9f647809e546">Ruby</a>は使っていなくて細かい部分はあまり覚えていないが、もし経験していなかったらこの感動は得にくかっただろう。プログラミング言語には、単に実装のためだけでなく、先人の知見を学ぶ共通言語として必要な面がある。特定の領域知識は、プログラミング言語によって偏って存在している。
</p>

<p>
一度なにかの言語で学べば、ほかの言語と比較して理解しやすかったり、処理系に対しての改善を考えやすい。仕事で使わなくても、教養として理解しておくと助かることがある。
</p>
</div>
</div>

<div id="outline-container-orgb8bb861" class="outline-2">
<h2 id="orgb8bb861"><a href="#orgb8bb861">関連</a></h2>
<div class="outline-text-2" id="text-orgb8bb861">
<ul class="org-ul">
<li><a href="20240529T002323--kdoc-179-『ハローhello-world-osと標準ライブラリのシゴトとしくみ』__book.html">KDOC 179: 『ハロー“Hello, World” OSと標準ライブラリのシゴトとしくみ』</a>でも、別の実装を見て比較してみる重要性が説かれていた</li>
<li><a href="20240612T133312--kdoc-190-『rubyのしくみ-ruby-under-a-microscope』__draft_book.html#ID-20240612T133312">KDOC 190: 『Rubyのしくみ Ruby Under a Microscope』</a>を読んでいて考えたこと</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
